app/controllers/movies_controller.rb

  def index
    # binding.pry
    # Ratings
    @all_ratings = Movie.all_ratings
    if params[:ratings]
      @selected_ratings = session[:ratings] = params[:ratings].keys
    else
      if session[:ratings]
        @selected_ratings = session[:ratings]
      else
        @selected_ratings = session[:ratings] = @all_ratings
      end
    end
    # @selected_ratings = params[:ratings].nil? ? @all_ratings : params[:ratings].keys
    @movies = Movie.where(rating: @selected_ratings)
    # Sorting
    if params[:sort]
      @movies = @movies.order params[:sort]
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R') ORDER BY release_date
SELECT "movies".* FROM "movies" ORDER BY release_date